from utils import important_message

def main() -> None:

    """Запрашивает у пользователя сообщение и выводит его в stdout с помощью функции important_message из другого модуля."""
    
    text = input(' Введите текст: ')
    
    print(f'\n{important_message(text)}\n')
    
    return None
    
    # D:\Лилия_мои_доки\Pythom_HW_git\Rafikova\2023.05.28>python -i 2.py
# >>> main()
 # Введите текст: ntrcdgadfgdh

#=====================================================================================================================#
#                                                                                                                     #
#                                                    ntrcdgadfgdh                                                     #
#                                                                                                                     #
#=====================================================================================================================#

# >>> text = 'Обратите внимание на очень важное сообщение от команды разработчиков этой великолепной программы!!!Обратите внимание на очень важное сообщение от команды разработчиков этой великолепной программы!!!'
# >>> msg = important_message(text)
# >>> print(msg)
#=====================================================================================================================#
#                                                                                                                     #
#     Обратите внимание на очень важное сообщение от команды разработчиков этой великолепной программы!!!Обратите     #
#             внимание на очень важное сообщение от команды разработчиков этой великолепной программы!!!              #
#                                                                                                                     #
#=====================================================================================================================#
# >>>