# База ФИО университета
# Группы:
C41 = [["Зайцев", "Сергей", "Александрович"], ["Зелинский", "Эдуард", "Юрьевич"], ["Яблочкин", "Павел", "Николаевич"], ["Котова", "Дарья", "Владимировна"], ["Зуева", "Ольга", "Викторовна"], ["Пучкова", "Софья", "Ивановна"],]
C42 = [["Васильева", "Татьяна", "Андреевна"], ["Сергеев", "Петр", "Михайлович",], ["Юдинцев", "Антон", "Валерьевич"], ["Иванисова", "Ирина", "Петровна"], ["Карпова", "Людмила", "Анатольевна"], ["Морозова", "Анна", "Владимировна"],]
C43 = [["Бобкова", "Ольга", "Николаевна"], ["Иванов", "Иван", "Иванович"], ["Бобров", "Сергей", "Юрьевич"], ["Антонова", "Елена", "Игоревна"], ["Ромашова", "Екатерина", "Яковлевна"], ["Носик", "Ирина", "Алексеевна"],]
С44 = [["Кадетова", "Клара", "Мефодиевна"], ["Курбатов", "Ильдус", "Алмазович"], ["Байгильдин", "Асман", "Ирикович"], ["Аванесян", "Ирина", "Гайковна"], ["Ожогина", "Кира", "Брониславовна"], ["Ломакина", "Марина", "Елизаровна"],]

# Кафедры:
Строматериалы = [["Павлова", "Снежана", "Вениаминовна"], ["Баварин", "Владлен", "Елизарович"], ["Кочергов", "Евгений", "Прокофьевич"], ["Савасина", "Ангелина", "Самиуловна"],]
Фундаменты = [["Гайфуллина", "Алина", "Ильдусовна"], ["Аскаров", "Рамазан", "Маратович",], ["Валлиулин", "Тимур", "Марселевич"], ["Исламова", "Алина", "Тимуровна"],]
Архитектура = [["Кистанова", "Ангелина", "Игоревна"], ["Аитов", "Адил", "Рафаэльевич"], ["Кобелев", "Юрий", "Александрович"], ["Краснова", "Инна", "Сергеевна"],]

# Список аудиторий кафедр:
# Кабинеты_СМ = ["11", "11A", "12", "13", "14", "14А", "15", "15Б",]
# Кабинеты_Ф = ["21", "21A", "22", "23", "24", "24А", "25", "25Б",]
# Кабинеты_А = ["31", "31A", "32", "33", "34", "34А", "35", "35Б",]

#Административные работники:
Административные_работники = [["Сафронова", "Анна", "Владимировна"], ["Курчатов", "Валентин", "Дмитриевич"], ["Жален", "Алексей", "Гинадьевич"], ["Винокурова", "Елена", "Матвеевна"], ["Бондарева", "Ксения", "Олеговна"], ["Корытова", "Любовь", "Сергеевна"], ["Казачкова", "Яна", "Игоревна"], ["Ековенко", "Андрей", "Викторович"], ["Курмакаев", "Ильдус", "Марсович"], ["Игнатьев", "Тимофей", "Романович"], ["Путин", "Владимир", "Ильич"], ["Иванько", "Валентина", "Георгиевна"],]


